Tekla.Structures.Model.LoadLine.LineLoadFormEnum
The line load form.

Tekla.Structures.Model.LoadLine.LineLoadFormEnum.LOAD_FORM_LINE_1
The load magnitude is uniform across the loaded length.

Tekla.Structures.Model.LoadLine.LineLoadFormEnum.LOAD_FORM_LINE_2
The load has different magnitudes at the ends of the loaded length.
The magnitude changes linearly between the ends.

Tekla.Structures.Model.LoadLine.LineLoadFormEnum.LOAD_FORM_LINE_3
The load magnitude changes linearly, from zero at the ends of the loaded length,
to a fixed value in the middle of the loaded length.

Tekla.Structures.Model.LoadLine.LineLoadFormEnum.LOAD_FORM_LINE_4
The load magnitude changes linearly, from zero at one end of the loaded length,
through two (different) values, back to zero at the other end.